DataProcessors/ЗагрузкаПриходаМатериаловИзCSV.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПриходаМатериаловИзCSV</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИмпорта</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ПоступлениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗагрузкаПриходаМатериаловИзCSV/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, Адрес, ИмяФайлаПуть, ДопПараметры) Экспорт
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;

		АдресФайлаВХ = Адрес;

		Объект.ИмяФайла = ИмяФайлаПуть;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьCSV(Команда)

	Если ОбщегоНазначения.НормСтрока(АдресФайлаВХ) = "" Тогда
		Сообщить("Сначала нажмите 'Выбрать файл'.");
		Возврат;
	КонецЕсли;

	ЗагрузитьCSVНаСервере(АдресФайлаВХ);

	Сообщить("Данные загружены: " + Строка(Объект.ТаблицаИмпорта.Количество()));

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьCSVНаСервере(АдресВХ) Экспорт

	Если Объект.ТаблицаИмпорта = Неопределено Тогда
		Сообщить("ТаблицаИмпорта не определена. Проверь реквизит обработки.");
		Возврат;
	КонецЕсли;

	Объект.ТаблицаИмпорта.Очистить();

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	Если ДвоичныеДанные = Неопределено Тогда
		Сообщить("Не удалось получить файл из временного хранилища.");
		Возврат;
	КонецЕсли;

	ИмяВремФайла = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанные.Записать(ИмяВремФайла);

	Чтение = Новый ЧтениеТекста(ИмяВремФайла, КодировкаТекста.UTF8);
	

	НомерСтроки = 0;

	Пока Истина Цикл

		Линия = Чтение.ПрочитатьСтроку();
		Если Линия = Неопределено Тогда
			Прервать;
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

		Линия = СтрЗаменить(Линия, Символы.ВК, "");
		Линия = СокрЛП(Линия);

		Если Линия = "" Тогда
			Продолжить;
		КонецЕсли;

		// заголовок
		Если НомерСтроки = 1 Тогда
			Если Найти(НРег(Линия), "АРТИКУЛ") > 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Кол = СтрРазделить(Линия, ";");
		Если Кол.Количество() < 4 Тогда
			Продолжить;
		КонецЕсли;

		Артикул      = СтрЗаменить(СокрЛП(Кол[0]), """", "");
		Наименование = СтрЗаменить(СокрЛП(Кол[1]), """", "");

		Количество = ОбщегоНазначения.ВЧислоБезопасно(Кол[2]);
		Цена       = ОбщегоНазначения.ВЧислоБезопасно(Кол[3]);

		Если Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрТ = Объект.ТаблицаИмпорта.Добавить();

		Попытка
			СтрТ.Артикул = Артикул;
			СтрТ.Наименование = Наименование;
			СтрТ.Количество = Количество;
			СтрТ.Цена = Цена;
		Исключение
			Попытка СтрТ["Артикул"] = Артикул; Исключение КонецПопытки;
			Попытка СтрТ["Наименование"] = Наименование; Исключение КонецПопытки;
			Попытка СтрТ["Количество"] = Количество; Исключение КонецПопытки;
			Попытка СтрТ["Цена"] = Цена; Исключение КонецПопытки;
		КонецПопытки;

	КонецЦикла;

	Чтение.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаИмпорта) Тогда
		Сообщить("Таблица импорта не заполнена. Сначала загрузите CSV.");
		Возврат;
	КонецЕсли;

	Если Объект.ТаблицаИмпорта.Количество() = 0 Тогда
		Сообщить("Таблица пустая. Сначала загрузите CSV.");
		Возврат;
	КонецЕсли;

	ДанныеДляСервера = Новый Массив;

	Для Каждого Стр Из Объект.ТаблицаИмпорта Цикл
		ДанныеДляСервера.Добавить(
			Новый Структура(
				"Артикул,Наименование,Количество,Цена",
				Стр.Артикул,
				Стр.Наименование,
				ОбщегоНазначения.ВЧисло(Стр.Количество),
				ОбщегоНазначения.ВЧисло(Стр.Цена)
			)
		);
	КонецЦикла;

	СсылкаДок = СоздатьДокументНаСервере(ДанныеДляСервера);

	Если СсылкаДок = Неопределено Тогда
		Сообщить("Документ не создан.");
		Возврат;
	КонецЕсли;

	Сообщить("Документ создан: " + Строка(СсылкаДок));


	Парам = Новый Структура;
	Парам.Вставить("Ключ", СсылкаДок);

		ОткрытьФорму("Документ.ПоступлениеМатериалов.ФормаОбъекта", Парам);

КонецПроцедуры

&НаСервере
Функция СоздатьДокументНаСервере(ТаблицаИмп) Экспорт

	Склад = Справочники.Склады.НайтиПоНаименованию("Основной");
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не найден склад 'Основной'. Создайте элемент справочника Склады с таким названием.");
		Возврат Неопределено;
	КонецЕсли;

	Док = Документы.ПоступлениеМатериалов.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Склад = Склад;

	Для Каждого Стр Из ТаблицаИмп Цикл

		Арт  = СокрЛП(Строка(Стр.Артикул));
		Наим = СокрЛП(Строка(Стр.Наименование));

		Если (Арт = "" И Наим = "") Тогда
			Продолжить;
		КонецЕсли;

		КолВо = ОбщегоНазначения.ВЧислоБезопасно(Стр.Количество);
		Цена  = ОбщегоНазначения.ВЧислоБезопасно(Стр.Цена);

		Если КолВо <= 0 Тогда
			Продолжить;
		КонецЕсли;

		МатСсылка = НайтиИлиСоздатьМатериал(Арт, Наим);

		Если НЕ ЗначениеЗаполнено(МатСсылка) Тогда
			Сообщить("Не удалось определить/создать материал для строки: " + Арт + " / " + Наим);
			Продолжить;
		КонецЕсли;

		СтрДок = Док.Материалы.Добавить();
		СтрДок.Материал   = МатСсылка;
		СтрДок.Количество = КолВо;
		СтрДок.Цена       = Цена;
		СтрДок.Сумма      = Окр(КолВо * Цена, 2);

	КонецЦикла;

	Попытка
		Док.Записать();
	Исключение
		Сообщить("Ошибка записи документа. Проверьте обязательные реквизиты и права.");
		Возврат Неопределено;
	КонецПопытки;

	Возврат Док.Ссылка;

КонецФункции
